--
-- PostgreSQL database dump
--

\restrict 1ZEJ10bydFbhb6gQJCgUvavLCtDJYnbkmOHd2bqh9K3m2wa6Nfc5qcvkfirAYA8

-- Dumped from database version 17.6
-- Dumped by pg_dump version 17.6

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Name: pg_trgm; Type: EXTENSION; Schema: -; Owner: -
--

CREATE EXTENSION IF NOT EXISTS pg_trgm WITH SCHEMA public;


--
-- Name: EXTENSION pg_trgm; Type: COMMENT; Schema: -; Owner: 
--

COMMENT ON EXTENSION pg_trgm IS 'text similarity measurement and index searching based on trigrams';


--
-- Name: pgcrypto; Type: EXTENSION; Schema: -; Owner: -
--

CREATE EXTENSION IF NOT EXISTS pgcrypto WITH SCHEMA public;


--
-- Name: EXTENSION pgcrypto; Type: COMMENT; Schema: -; Owner: 
--

COMMENT ON EXTENSION pgcrypto IS 'cryptographic functions';


SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: audit; Type: TABLE; Schema: public; Owner: kcj_app
--

CREATE TABLE public.audit (
    id uuid DEFAULT gen_random_uuid() NOT NULL,
    ts timestamp with time zone DEFAULT now() NOT NULL,
    user_id uuid,
    user_name text,
    action text NOT NULL,
    entity text,
    entity_id uuid,
    details jsonb
);


ALTER TABLE public.audit OWNER TO kcj_app;

--
-- Name: carriers; Type: TABLE; Schema: public; Owner: kcj_app
--

CREATE TABLE public.carriers (
    id uuid DEFAULT gen_random_uuid() NOT NULL,
    ppp integer,
    issue_date date,
    carrier_type text,
    carrier_serial text,
    employee text NOT NULL,
    "position" text,
    department text,
    cert_type smallint,
    cert_start date,
    cert_serial text,
    return_mark date,
    status text DEFAULT 'active'::text NOT NULL,
    sign_cert text,
    sign_carrier text,
    two_factor boolean DEFAULT false NOT NULL,
    created timestamp with time zone DEFAULT now() NOT NULL,
    updated timestamp with time zone DEFAULT now() NOT NULL,
    CONSTRAINT carriers_status_check CHECK ((status = ANY (ARRAY['active'::text, 'returned'::text, 'expired'::text, 'reserved'::text])))
);


ALTER TABLE public.carriers OWNER TO kcj_app;

--
-- Name: cert_types; Type: TABLE; Schema: public; Owner: kcj_app
--

CREATE TABLE public.cert_types (
    code smallint NOT NULL,
    name text NOT NULL,
    title text NOT NULL,
    default_valid_years smallint DEFAULT 2 NOT NULL,
    description text
);


ALTER TABLE public.cert_types OWNER TO kcj_app;

--
-- Name: certificates; Type: TABLE; Schema: public; Owner: kcj_app
--

CREATE TABLE public.certificates (
    id uuid DEFAULT gen_random_uuid() NOT NULL,
    carrier_id uuid NOT NULL,
    cert_type smallint NOT NULL,
    serial_number text,
    valid_from date NOT NULL,
    valid_to date,
    status text DEFAULT 'active'::text NOT NULL,
    note text,
    created timestamp with time zone DEFAULT now() NOT NULL,
    updated timestamp with time zone DEFAULT now() NOT NULL,
    CONSTRAINT certificates_status_check CHECK ((status = ANY (ARRAY['active'::text, 'expired'::text, 'revoked'::text, 'reserved'::text])))
);


ALTER TABLE public.certificates OWNER TO kcj_app;

--
-- Name: users; Type: TABLE; Schema: public; Owner: kcj_app
--

CREATE TABLE public.users (
    id uuid DEFAULT gen_random_uuid() NOT NULL,
    login text NOT NULL,
    full_name text NOT NULL,
    role text NOT NULL,
    salt text NOT NULL,
    hash text NOT NULL,
    active boolean DEFAULT true NOT NULL,
    created timestamp with time zone DEFAULT now() NOT NULL,
    last_login timestamp with time zone,
    CONSTRAINT users_role_check CHECK ((role = ANY (ARRAY['admin'::text, 'operator'::text, 'auditor'::text])))
);


ALTER TABLE public.users OWNER TO kcj_app;

--
-- Data for Name: audit; Type: TABLE DATA; Schema: public; Owner: kcj_app
--

COPY public.audit (id, ts, user_id, user_name, action, entity, entity_id, details) FROM stdin;
33281512-d3d3-456d-bbe0-a6bd3876daca	2026-10-22 11:02:33.588276+03	fab5f3da-108f-4eef-8c40-8358b69e8cb5	Администратор	login	user	fab5f3da-108f-4eef-8c40-8358b69e8cb5	\N
2bf5bab7-872c-4418-8269-3ee9b05b00cd	2026-10-22 11:02:43.568446+03	fab5f3da-108f-4eef-8c40-8358b69e8cb5	Администратор	login	user	fab5f3da-108f-4eef-8c40-8358b69e8cb5	\N
a115bcba-4c36-4448-a7c3-5d179da77457	2026-10-22 11:03:10.398472+03	fab5f3da-108f-4eef-8c40-8358b69e8cb5	Администратор	import_bulk	carrier	\N	{"added": 189}
fc41747e-603c-440c-bb9c-b5ad478fa3f5	2026-10-22 11:28:29.425573+03	fab5f3da-108f-4eef-8c40-8358b69e8cb5	Администратор	logout	user	fab5f3da-108f-4eef-8c40-8358b69e8cb5	\N
80d69175-276d-4a78-9e21-1e3d967b79a8	2026-10-22 11:28:30.905147+03	fab5f3da-108f-4eef-8c40-8358b69e8cb5	Администратор	login	user	fab5f3da-108f-4eef-8c40-8358b69e8cb5	\N
35de8c91-a461-428d-ae87-fe880f5105a2	2026-10-22 11:31:33.159712+03	fab5f3da-108f-4eef-8c40-8358b69e8cb5	Администратор	user_create	user	50139f36-933e-4957-bdc8-efa9b1c0ce8d	\N
d420bd05-26a2-4c13-b4d0-1502073f0f9b	2026-10-22 11:31:40.049886+03	fab5f3da-108f-4eef-8c40-8358b69e8cb5	Администратор	logout	user	fab5f3da-108f-4eef-8c40-8358b69e8cb5	\N
b1b5e695-8bc7-4311-82a9-f4e8b1560897	2026-10-22 11:32:18.795274+03	fab5f3da-108f-4eef-8c40-8358b69e8cb5	Администратор	login	user	fab5f3da-108f-4eef-8c40-8358b69e8cb5	\N
\.


--
-- Data for Name: carriers; Type: TABLE DATA; Schema: public; Owner: kcj_app
--

COPY public.carriers (id, ppp, issue_date, carrier_type, carrier_serial, employee, "position", department, cert_type, cert_start, cert_serial, return_mark, status, sign_cert, sign_carrier, two_factor, created, updated) FROM stdin;
eec48462-052b-431a-8bc2-c0c3346ac442	1	2001-01-31	3	4	5			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
8163dc82-1ef0-42b5-9ef8-85f6c84c8016	2	\N	JaCarta PKI	F2130BE3	Негодин Александр Александрович	Инженерпрограммист	ИУС	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
1d368e18-37a5-4e40-a762-7eb3fe99020e	3	\N	JaCarta PKI	D3DBC2B5	Тебякина Надежда Викторовна	Ведущий юрисконсульт		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
91a268b1-6390-4f47-9c12-9a53c802cd45	4	\N	JaCarta PKI	535A1FAB	Герасимов Сергей Петрович	Приборист 5 разряда Служба метрологии и учета газа		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
2e6fed72-bb1a-4714-83ed-ab80b0c6996e	5	\N	JaCarta PKI	9CC3C49C	Чинин Вячеслав Юрьевич	Ведущий инженерпрограммист		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
c2059c9f-f124-44ab-ba44-03d61081f460	6	\N	JaCarta PKI	5.52E+05	Иночкина Елена Витальевна	Экономист 1й категории		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
aaa76247-79cb-483f-b72c-af2f98893332	7	\N	JaCarta PKI	FAFDB613	Леонова Татьяна Валерьевна	Ведущий бухгалтер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
d714a668-a8cf-4dd0-81fd-6b922862819a	8	\N	JaCarta PKI	15A09FEE	Негодина Раиса Александровна	Бухгалтер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
24f4e64c-b708-4205-84df-3bf33bf62d0e	9	\N	JaCarta PKI	C781956F	Лапин Сергей Валентинович	Контролер контрольно-пропускного пункта Контрольно-пропускной пункт		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
5533e06f-7ae0-4285-9b7f-a73f09da8433	10	\N	JaCarta PKI	AAF97F7C	Ляскин Дмитрий Сергеевич	Ведущий инженер Газокомпрессорная служба (Алгасово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
2cfc3d75-0100-4b54-813a-fffbce26d076	11	\N	JaCarta PKI	1CEDB899	Быканова Светлана Сергеевна	Инженерпрограммист		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
af48aed7-4199-430d-8b5e-1cdef9ad6456	12	\N	JaCarta PKI	CDF952C1	Иванов Алексей Вячеславович	Инженер 2 категории Служба метрологии и учета газа		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
4db9f7d0-38f9-41db-9b28-b408e4673ad7	13	\N	JaCarta PKI	F7D3EB74	Толстопятова Ирина Николаевна	Экономист		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
071d23b6-ca44-4f6b-810e-be169ebe7a14	14	\N	JaCarta PKI	1B2A01D0	Лобызнова Ирина Владимировна	Заведующий складом		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
a7aa1d08-de82-4be0-be18-0f5fe7f3a442	15	\N	JaCarta PKI	8ABFF68A	Негодяев Дмитрий Михайлович	Диспетчер автомобильного транспорта Автотранспортное хозяйство		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
f721a810-647e-4bf4-8156-05cec599e767	16	\N	JaCarta PKI	A0EDC4B4	Коробова Оксана Анатольевна			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
49b07cd6-86ce-46c8-997e-951af55a4714	17	\N	JaCarta PKI	91C440D1	Плаксина Марина Анатольевна			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
3cd7df78-45d7-40e8-a168-5e2de4dc1b00	18	\N	JaCarta PKI	8A141AFE	Черкашин Павел Александрович	Заместитель главного инженера поОТиПБ		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
bd176003-f25e-443d-a551-f412d2c3925d	19	\N	JaCarta PKI	41BB1E4D	Черданцева Марина Юрьевна	Ведущий бухгалтер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
a734ed7c-0fe9-460b-b16c-a0b0ccde2e56	20	\N	JaCarta PKI	36E8D6B1	Черникова Наталья Александровна	Специалист по охране труда		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
cbf45a87-bf28-4255-bbd7-97cfdf773513	21	\N	JaCarta PKI	975D53DA	Тагиров Павел Игоревич	Инженер 2 категории Служба КИПиА	телемеханики и эксплуатации АСУ ТП	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
a12493a0-79ff-4bf6-af81-4447a9ab350a	22	\N	JaCarta PKI	9BD939CB	Шариков Николай Иванович	Инженер 2 категории Служба КИПиА	телемеханики и эксплуатации АСУ ТП	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
44028225-9458-4ba3-9f37-b584973d7ed8	23	\N	JaCarta PKI	92135C26	Попова Елена Владимировна	Специалист по кадрам		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
39915926-2166-450b-b855-1fe41c707b1d	24	\N	JaCarta PKI	1945C434	Рассказова Светлана Юрьевна	Специалист по кадрам		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
70af53af-7012-44ea-bdd0-4a9e6a28d490	25	\N	JaCarta PKI	AAFF3C8F	Разваляева Ирина Викторовна	Бухгалтер 1й категории		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
55dc8e32-fefd-4875-befe-8155106fd98c	26	\N	JaCarta PKI	74447DDA	Базилев Александр Владимирович	Ведущий инженер по ГОЧС		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
47e3e82c-ce85-4a03-901d-44d29617460b	27	\N	JaCarta PKI	053F0AE8	Ермаков Дмитрий Анатольевич	Инженер 1 категории Газокомпрессорная служба (Давыдово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
00eb3eae-dc3b-4d60-b9a7-2a767445ced1	28	\N	JaCarta PKI	FBB0441D	Исаченко Леонид Эдуардович	Инженер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
9e1ed8de-1fa5-4b55-a915-709dd98f47d2	29	\N	JaCarta PKI	477BB00D	Корсакова Юлия Юрьевна	Инженер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
3d819e31-38ac-49e5-b811-163d80acd4ed	30	\N	JaCarta PKI	DB25FDCC	Лыков Анатолий Александрович	Ведущий инженер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
07de3a34-b65e-4eab-9f3b-06c3e577495f	31	\N	JaCarta PKI	37DCA473	Ольшанский Владимир Анатольевич	Ведущий инженер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
b5db526e-4bee-4003-8cd5-1351721b9151	32	\N	eToken 5110	025B0F1F	Симаков Александр Анатольевич	Начальник службы		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
22213f59-e936-4982-afc3-1bd230a2f72d	33	\N	JaCarta PKI	AAD08998	Федулов Никита Валерьевич	Инженер 1 категории Газокомпрессорная служба (Алгасово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
9daf5872-5fd2-4d70-9ac0-c73f7c5c058a	34	\N	JaCarta PKI	A57844FC	Фролов Геннадий Михайлович	Начальник службы		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
460846d2-f0f2-45b4-9fcb-9636e379030b	35	\N	JaCarta PKI	6385E7C4	Щербаков Вячеслав Викторович	Ведущий инженер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
52acb2ce-32e0-4b04-a836-e87976b7c5a2	36	\N	JaCarta PKI	9FA3751A	Бычков Александр Сергеевич	Ведущий инженер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
e6bd768c-839e-4d94-99d1-f53952fe7260	37	\N	JaCarta PKI	034A0799	Петренко Ольга Викторовна	Специалист по охране труда 1 категории Руководство и аппарат при руководстве		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
1a066156-3066-412f-a896-ed01bf66844a	38	\N	JaCarta PKI	08238038	Глагазин Юрий Алексеевич	Начальник службы		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
beb03871-3be7-48ae-aa82-477f0732a6d3	156	\N	JaCarta PKI	6EA560E2	Асосков Алексей Викторович	Инженер КИПиА		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
fef954fe-1f73-4c94-93e9-d2c299fd4f2d	39	\N	JaCarta PKI	C3006CB8	Терехов Дмитрий Владимирович	Главный инженер Руководство и аппарат при руководстве		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
28c4ffe7-7633-48c1-b81a-1be46ba3ec31	40	\N	JaCarta PKI	FFAA1042	Голова Ольга Геннадьевна	Машинист технологических компрессоров 6 разряда		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
f23bf8a8-51fb-4400-9201-206aaed72d0c	41	\N	JaCarta PKI	10A995DE	Байдалинова Елена Евгеньевна	Машинист технологических компрессоров 6 разряда		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
b9b8614c-e318-4e9a-bff3-e2fe7ff6ddf0	42	\N	JaCarta PKI	31D5597D	Базилева Наталья Викторовна	Специалист Руководство и аппарат при руководстве		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
6ac3b1ab-ae29-4a9a-93b7-10bbfe53c944	43	\N	JaCarta PKI	D6654D28	Анисимов Николай Геннадиевич	Инженер-программист 1 категории Группа сопровождения эксплуатации и развития локальных информаци		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
0fe0962c-ae84-4f0e-a2dd-f4c01c47eeee	44	\N	JaCarta PKI	DAE42C48	Васильева Ирина Анатольевна	Штукатур 4 разряда		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
fd3c4dda-151e-4b0f-af56-8ee486f71bf7	45	\N	JaCarta PKI	5441DBA8	Глагазина Наталья Александровна	Заведующий хозяйством		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
a8e94ace-09fa-4d1f-85f3-d3125c02fd36	46	\N	JaCarta PKI	1B8F1F27	Киселева Ольга Владимировна	Приборист 6 разряда		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
0cd5472d-f927-4b1e-8793-f911b9639f7b	47	\N	JaCarta PKI	F8BE93E4	Кочетов Олег Николаевич	Старший диспетчер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
38743785-4b4a-4c8e-aaa9-65a9c1cc2f32	48	\N	JaCarta PKI	21177FAC	Чинин Вячеслав Юрьевич	Сканер АСУ 0		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
5409dda3-400e-4d40-8d0f-90e9a79521ff	49	\N	JaCarta PKI	E60F5AF9	Леонова Елена Михайловна	Техник 1й категории		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
1a48ad36-13cf-4201-a986-87647bcfdc3c	50	\N	JaCarta PKI	47229FAB	Рокутов Леонид Юрьевич	Ведущий инженер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
333247f1-dbcb-4c38-bbff-62a364cec7b8	51	\N	JaCarta PKI	BCAC4C80	Рыбина Юлия Витальевна	Заведующий хозяйством		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
25fe69d0-183c-4b0a-82d6-f596ffdda72b	52	\N	JaCarta PKI	41E43B5A	Чинин Николай Юрьевич	Начальник службы Служба метрологии и учета газа		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
a66de299-834f-4cc0-8a84-9d39a1feff0c	53	\N	JaCarta PKI	0B16ACF0	Головочев Михаил Олегович	Токарь Автотранспортное хозяйство		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
4cffe7f8-9b05-45a2-be77-3d37fb9b3fa8	54	\N	JaCarta PKI	AB7CD158	Груздев Александр Владимирович	Машинист технологических компрессоров 6 разряда Газокомпрессорная служба (Давыдово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
8fe28f6b-c41b-4269-94c8-421aff4a938b	55	\N	JaCarta PKI	7e7942c3	Милованов Руслан Витальевич	Машинист технологических компрессоров Газокомпрессорная служба (Давыдово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
81774731-3c85-4774-94d9-338367d43e43	56	\N	JaCarta PKI	C92F09B5	Зотников Дмитрий Анатольевич	Специалист по охране труда 2 категории Руководство и аппарат при руководстве		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
7aa1dca9-6881-4543-a0bb-ddf37604566e	57	\N	JaCarta PKI	04B24C5A	Карев Геннадий Геннадьевич	Контролер контрольнопропускного пункта 3го разряда		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
25c59f3a-2960-4fd5-ad51-22428f5bf807	58	\N	JaCarta PKI	589AFC84	Киселев Григорий Петрович	Инженер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
a079c47e-0c12-494c-adac-69b18b1ebf3b	59	\N	JaCarta PKI	99029FFD	Лагерев Михаил Геннадьевич	Ведущий инженер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
e3509982-c15b-4f17-885e-d0dff60931ca	60	\N	JaCarta PKI	3C1D4EC6	Мячиков Виталий Викторович	Старший мастер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
4f9c1ad8-043a-4871-9bc5-13f85cce165a	61	\N	JaCarta PKI	D09F1F19	Шангина Марина Александровна	Электромонтер по ремонту и обслуживанию электрооборудования 6го разряда		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
ae8139bc-5fe1-4909-b2fd-177c4e61158a	62	\N	JaCarta PKI	55AAFA2F	Габрусев Михаил Александрович	Начальник филиала		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
914223f6-e987-4930-8193-ab600575757b	63	\N	JaCarta PKI	6EA0A1D9	Обучение в Первомайском УПЦ	0 0		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
f485ca6b-4053-4745-9891-388010c02731	64	\N	JaCarta PKI	9A8E3746	Обучение в Первомайском УПЦ	0 0		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
698e9239-5911-4419-b886-2d460d1996ef	65	\N	JaCarta PKI	53474100	Болтышев Антон Олегович			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
68efcd1a-890e-4a04-b27d-5d3c0510ea5e	66	\N	JaCarta PKI	0D953F2A	Власов Игорь Владимирович			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
c8e01d09-e326-40f6-a98b-d442c18240ba	67	\N	JaCarta PKI	A19782F2	Баринова Валентина Александровна			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
cc2dd087-9a15-4e2a-8365-c5487bc4f2f8	68	\N	JaCarta PKI	C9ADF4BF	Елисеев Кирилл Алексеевич	Обходчик линейный Линейно-эксплуатационная служба		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
fbae9045-4b15-4558-86a9-7eb9ff6ccc7e	69	\N	JaCarta PKI	E15AF883	Студия Алгасово Моршанское ЛПУМГ	0 0		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
ea093e62-ea6e-4482-a145-df0b69c92ddb	70	\N	JaCarta PKI	6AAECF55	Майорова Елена Геннадьевна	Электромеханик 2 категории Служба связи		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
48a353ae-4fe0-4b4e-9baa-7c3c2c283c47	71	\N	JaCarta PKI	8B10B240	Орлова Наталия Ивановна			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
6990e645-dfe8-4c54-b15f-d586a7429cd7	72	\N	JaCarta PKI	367A7C0E	Пашигорев Денис Валерьевич			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
11c740d4-4764-46fb-ad85-741f37ba576a	73	\N	JaCarta PKI	3A250836	Симакова Елена Олеговна			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
29da114e-ef41-4701-b0ac-a6fa7935d73f	74	\N	JaCarta PKI	0D3D4434	Разволяев Павел Александрович	Мастер Служба защиты от коррозии		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
7abcb6fa-7ad4-473b-ae00-9a5d3eb9edd4	75	\N	JaCarta PKI	31984ED2	Щербаков Денис Валерьевич			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
ac6770f9-ba77-4385-a790-05064036b908	76	\N	JaCarta PKI	E9E6DAEE	Щербаков Андрей Андреевич			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
a49eaa73-e62b-4904-88a9-a2ed2f8cacf1	77	\N	JaCarta PKI	AAA13349	Пашигорев Антон Дмитриевич	Инженер 2 категории Аварийно-восстановительный поезд		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
1d70e96f-198b-4f4a-b143-77e850da3e3a	78	\N	JaCarta PKI	6D8A1D79	Булатов Илья Владимирович			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
587aaadb-c239-4e08-b020-dfe942f094e0	79	\N	JaCarta PKI	6BF1BCB9	Чуженьков Роман Владимирович			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
81d4b140-6e63-4016-af90-8f6c9184cc58	80	\N	JaCarta PKI	ECC583D4	Киселев Денис Сергеевич			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
64e793e8-a46e-4f65-98e4-7f130a15af5c	81	\N	JaCarta PKI	E566CC2A	Попов Максим Анатольевич	Ведущий инженер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
69f786eb-7290-49d5-9c46-0850386b0839	82	\N	JaCarta PKI	113396f2	Соколова Светлана Юрьевна	Лаборант химического анализа 5 разряда Химико-аналитическая лаборатория		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
e8d7758c-ca6d-432e-8357-622b086474b5	83	\N	JaCarta PKI	???????	Новиков Александр Владимирович	Старший мастер Служба энерготепловодоснабжения		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
4461a18d-be72-4922-8033-60c40af00284	84	\N	JaCarta PKI	1BE18C7C	Скугарь Денис Владимирович	Механик		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
34267e14-9ebe-42a4-b6ba-e3d56e39633a	85	\N	JaCarta PKI	33B1F380	Асосков Андрей Геннадьевич	Диспетчер Диспетчерская служба		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
5e1b0748-fe37-445f-b4ca-fc2bec0da475	86	\N	JaCarta PKI	38FC7857	Банников Владимир Юрьевич	Ведущий инженер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
9280f231-2353-48ab-a4de-f889a7c60854	87	\N	JaCarta PKI	FF227986	Барабанов Сергей Евгеньевич	Оператор заправочных станций		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
06b13c57-47ce-44ec-a840-473bbf7e59ea	88	\N	JaCarta PKI	1D979F0C	Кузьмин Константин Александрович	Ведущий инженер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
8bb7a674-7252-4c24-ba45-8c611433ca96	89	\N	JaCarta PKI	B1266166	Загребнев Денис Николаевич	Мастер Газокомпрессорная служба (Алгасово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
fa103988-ead2-4cd8-a0ad-c584aa2d48ad	90	\N	JaCarta PKI	66F5B826	Романенко Алексей Вячеславович	Электромеханик		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
00415f25-ccd7-497b-82b8-49507fd181ec	91	\N	JaCarta PKI	0FE68EF5	Чичёва Марина Викторовна	Обходчик линейный 4го разряда		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
d7f27838-f024-43ca-8e0a-4e940dd2f48f	92	\N	JaCarta PKI	72AF2DEC	Моршанское ЛПУМГ Студия	0 0		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
0448e663-64b6-4f23-b51e-6a1faaa221ca	93	\N	JaCarta PKI	7218B2F9	Садовов Андрей Михайлович	Инженер по контрольноизмерительным приборам и автоматике		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
1c14c3c7-86ff-4456-a865-ac96652f6c67	94	\N	JaCarta PKI	4EBC67C4	Козырев Дмитрий Александрович			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
90d89c78-29e3-4f31-a60d-b4d28fe9d13e	95	\N	JaCarta PKI	8DE10C0C	Севостьянов Вячеслав Николаевич	Электромеханик Служба связи		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
39cce484-d234-4b48-86da-720017c80b61	96	\N	JaCarta PKI	AED58A41	Критинина Наталия Викторовна			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
5fa4857b-9534-4280-bd62-4d7f9ae058ab	97	\N	JaCarta PKI	FF0FC5F9	Кургапкин Антон Юрьевич	Инженер 2 категории Аварийно-восстановительный поезд		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
061a3933-bea4-4336-a17a-03c392fa7865	98	\N	JaCarta PKI	681D2791	Зайцев Олег Борисович	Начальник службы		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
e79da106-4a7d-495f-80ac-683999110995	99	\N	JaCarta PKI	95E1773E	Суслина Александра Викторовна	Старший специалист по кадрам		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
7006097d-6480-41e9-86f1-e9b3c97f7f9b	100	\N	JaCarta PKI	D453C57D	Сычев Павел Дмитриевич	Инженер 1 категории Хозяйственный участок		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
3f1796c7-0433-49fd-9d96-17ba20468366	101	\N	JaCarta PKI	64F1549E	Парамзин Павел Евгеньевич	ведущий инженер (по безопасности)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
29aebafa-08c7-4a7f-8914-0f9cd38f660a	102	\N	JaCarta PKI	151815F7	Садовова Яна Владимировна	Приборист КИПиА 6р		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
dcff0062-c169-4d60-8a39-1e17da2f443f	103	\N	JaCarta PKI	9621D3E9	Ермаков Сергей Николаевич	Инженер ЭТВС		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
910b7b27-90d6-497b-aaea-03b8bb6f8bd2	104	\N	JaCarta PKI	1D43DAD7	Городков Н.В.	слесарь ТУ	ГРС	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
e7a14dd6-4e82-418d-9536-f27c4b85ed9f	105	\N	JaCarta PKI	10A0E662	Кузяев Сергей Николаевич	Механик АТХ		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
3b7e5a3c-f4f0-4c5c-9131-42573659c450	106	\N	JaCarta PKI	457CE4F7	Кудинова Ольга Владимировна	Техник	АТХ	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
fd0a382a-2c9e-4c88-94aa-73c1f16cf03a	107	\N	JaCarta PKI	D00981A7	Болтышева Анна Андреевна	Специалист ОК	АУП	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
bdd5d206-12c2-4638-813c-10c046044a9d	108	\N	JaCarta PKI	9CA0EFB6	Попов Александр Ильич	Инженер 2 категории Служба энерготепловодоснабжения		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
a7bb96ed-d9c3-40e8-8640-c490d352bbff	109	\N	eToken 5110	02A42E5F	Асосков Владимир Анатольевич	Инженер ЛЭС		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
2e11e515-b71c-497f-813f-8cd87d87b647	110	\N	JaCarta PKI	6DF28A9B	Рябов Максим Владимирович	Инженер АВП		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
f4f7701f-d4d6-49e8-9acb-6b9b6c701bf7	111	\N	JaCarta PKI	1097D27C	Ядов Сергей Викторович	Начальник участка Хозяйственный участок		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
7fff3d5e-20b1-4b3e-96a8-93a6befa2d5f	112	\N	JaCarta PKI	1C1F7135	Сластухин Сергей Александрович	Инженер 1 кат	Метрология	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
6faf4f0f-1952-4458-895a-7f5673e058ac	113	\N	JaCarta PKI	9C3BB80C	Сухоломкина Виктория Сайтовна	Кладовщик	РСР и МТC	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
df41a436-dc7a-480f-95f2-91563e13194f	114	\N	JaCarta PKI	FD6E4831	Бородин Игорь Станиславович	Диспетчер ДС		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
e1e411bd-138d-4c3b-86bc-ccf1752fa8c8	115	\N	JaCarta PKI	990049AA	Бородина Татьяна Николаевна	Приборист КИПиА	ТМ ЭАСУТП	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
a9b35abc-0a4f-4650-ae39-6f793a60a791	157	\N	JaCarta PKI	F8F33750	Исмагилов Никита Витальевич	Инженер 2 категории Линейно-эксплуатационная служба		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
8ff3afeb-d6ca-455b-be9f-608514293a4e	116	\N	JaCarta PKI	229056B1	Стрельников Станислав Сергеевич	Слесарь по ремонту технологических установок 5 разряда Служба по эксплуатации газораспределительных станций		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
8b41df58-a094-472b-8b6b-806cbc21b0ad	117	\N	JaCarta PKI	760FF5F6	Олейников Александр Алексеевич	Ведущий инженер по ООС (Эколог)	АУП	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
ba251f76-6356-4e4c-b3db-9b66febeb0a8	118	\N	JaCarta PKI	845155B6	Коновалов Михаил Сергеевич	Водитель Автотранспортное хозяйство		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
b1055cc3-f100-4c5f-aebc-7f823226f251	119	\N	JaCarta PKI	BDE82FD1	Дрямова Мария Васильевна	Техник 1 категории Хозяйственный участок		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
ce84c696-2cdd-4960-895b-2941043b2199	120	\N	JaCarta PKI	B8798C78	Кулев Сергей Александрович	Инженер	Связь	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
fa47af37-a2a1-441e-92cd-f0207b13b8ad	121	\N	JaCarta PKI	E144EA7A	Нечаев Алексей Николаевич	Эл.механик	Связь	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
45c946d6-deba-4755-947d-4de5fecba334	122	\N	JaCarta PKI	D8EC534E	Лучин Дмитрий Владимирович	Контролер КПП Контрольно-пропускной пункт		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
ede2378b-28b7-40f0-b742-9e135abdb14d	123	\N	JaCarta PKI	70E06A52	Учетная запись обучающегося в УПЦ 1	0 0		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
d00747f4-0d0a-4c6c-9a19-cb534b689f16	124	\N	JaCarta PKI	DC4D33FB	Учетная запись обучающегося в УПЦ 2	0 0		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
f7ff851a-78a4-4d01-b438-7d59b74408e1	125	\N	JaCarta PKI	E83AA0F1	Хмылев Андрей Николаевич	Начальник службы Линейно-эксплуатационная служба		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
ff88707d-a4cd-4af2-8d73-d0e54cf34236	126	\N	JaCarta PKI	1D678DD3	Чуженькова Марина Сергеевна	Лаборант ХЛ		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
1873fc64-89f0-4f56-b114-f085398c954a	127	\N	JaCarta PKI	BD636B95	Брюнина Ирина Александровна	Зам.гл.бухгалтера	УКГ	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
b77ed3d5-1939-4476-bb30-0e9493821b11	128	\N	JaCarta PKI	449C197E	Серебряков Павел Михайлович	Начальник службы Газокомпрессорная служба (Алгасово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
53311c9d-0bfb-4196-8fdc-52269d5733dd	129	\N	JaCarta PKI	C86393AE	Ярюкина Ольга Олеговна	Вед.инженер	Связь	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
438e9981-d251-48cd-b954-29c726c0bd3f	130	\N	JaCarta PKI	86209F91	Артемкин Сергей Михайлович			\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
91e8c623-8c66-4ec6-bf4b-d2f55904646b	131	\N	JaCarta PKI	70DC9C33	Горбунов Андрей Владимирович	Электромеханик Служба связи		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
f649ea47-0a9b-48bf-9f08-f79f5eabc34d	132	\N	JaCarta PKI	FD3047F7	Оркин Алексей Сергеевич	Диспетчер	ДС	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
1ee91c0e-b4fd-4175-a3b6-e26b50404abc	133	\N	JaCarta PKI	A6B3E3C5	Кондрашов Алексей Викторович	Инженер КИПиА		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
9eefac18-def5-4f95-a2ec-5c995d8af9b6	134	\N	JaCarta PKI	31F14647	Савцов Максим Юрьевич	Инженер ЭТВС		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
5c9f2298-e4fc-4cc4-ac35-03d37e167cfc	135	\N	JaCarta PKI	F6C33597	Воронков Денис Александрович	Инженер МИУГ		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
c49b3a94-a223-47df-8564-b6fcc1535c06	136	\N	JaCarta PKI	11ED9644	Водопьянова Ирина Геннадьевна	Техник		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
693342ac-8bd7-4979-bd9e-ae172d6d59b3	137	\N	JaCarta PKI	0D6BD82C	Болдырев Максим Иванович	Диспетчер	ДС	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
f2724026-9699-4c5b-b0cf-a505c6ea2ee3	138	\N	JaCarta PKI	31571949	Ярмаркин Сергей Викторович	Диспетчер	ДС	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
d52a2ae2-948d-4579-99cc-4ec208661ad9	139	\N	JaCarta PKI	23E933DC	Новиков Юрий Викторович	Сменный инженер ГКС		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
0327d069-b0a6-4813-a9e7-0189314cac6f	140	\N	JaCarta PKI	C9330FF9	Болтышев Артём Олегович	Сменный инженер ГКС		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
40052d16-4fdf-43f4-a77e-5308735d76ed	141	\N	JaCarta PKI	265F9E1D	Оркин Александр Сергеевич	Инженер 2-й категории Служба связи		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
25662939-f24a-489f-b956-fec4db93cf42	142	\N	JaCarta PKI	32CD5655	Фролов Андрей Михайлович	Председатель профкома		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
84cc8546-440b-409b-a0e5-c33a04de2184	143	\N	JaCarta PKI	01FBB4B7	Метальников Денис Геннадьевич	Электромеханик связи		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
bb4a750e-981d-4341-b694-8b62e578248c	144	\N	JaCarta PKI	32AAF161	Метальников Денис Геннадьевич	Электромеханик связи		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
386e0ea9-426b-4663-80a7-4627be89507c	145	\N	JaCarta PKI	BE42FF30	Перевертова Елена Юрьевна	Диспетчер АТХ		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
1cd21d4c-f19f-4825-bfb2-6cb76ea68872	146	\N	JaCarta PKI	5F23CE09	Орлов Николай Валерьевич	ЭТВС		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
086f11e2-044f-477e-bd09-8315b6363ea9	147	\N	JaCarta PKI	00C5C2E1	Ачапин Максим Александрович	Дефектоскопист рентгенно-гаммаграфирования 5р Аварийно-восстановительный поезд		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
d2ef1ec6-3a82-4af1-a4b6-ee8a4252c437	148	\N	JaCarta PKI	3F50A855	Вечерин Дмитрий Владимирович	Фельдшер высшей категории Здравпункт		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
4cfed00e-9d7b-4acd-919c-5c3cad699130	149	\N	JaCarta PKI	0D52001025188203	Свечников Александр Владимирович	АВП		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
e2beb711-67c9-4fc2-9486-846b83a77aaa	150	\N	JaCarta PKI	24F01D65	Яланский Николай Алексеевич	АВП		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
f1d444f2-e9a7-4938-8821-02d7006381ed	151	\N	JaCarta PKI	A5B051D5	Вязьмин Денис Павлович	Начальник  караула СПО		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
47cf468d-6cc3-42ae-8d22-30b12defaad2	152	\N	JaCarta PKI	5D0CB2FC	Банников Виталий Владимирович	СЗК		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
8a1b0991-4d39-478d-968f-2d059ca4eac1	153	\N	JaCarta PKI	E0436A9E	Суворов Никита Анатольевич	Инженер Служба КИПиА	телемеханики и эксплуатации АСУ ТП	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
7e313bab-d7dd-4615-9a1e-66ec0c8346df	154	\N	JaCarta PKI	C4F51049	Склёмина Ирина Владимировна	КИПиА		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
f9c46271-894f-4b47-a42c-c1cda436958e	155	\N	JaCarta PKI	E287DDDD	Воронков Андрей Александрович	МИУГ		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
70dc5b54-f168-492c-83c3-a15e97bb70c3	158	\N	JaCarta PKI	D29D3985	Боровкова Мария Олеговна	Экономист по труду		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
2cdc936f-cdf8-4bbf-8945-a97a008e2628	159	\N	JaCarta PKI	C4AC0617	Карев Виктор Александрович	ЭТВС		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
d6a2b40c-b47a-46db-b4da-4d88faff1e02	160	\N	JaCarta PKI	A0E53B9D	Лебедев Александр Викторович	Связь		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
60b8a66b-9cf3-4f4b-9092-71c3747cd1bc	161	\N	JaCarta PKI	04B0F56C	Рудометкин Роман Александрович	Дефектоскопист рентгено-	гаммаграфирования 6 разряда Аварийно-восстановительный поезд	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
f98525ad-9d58-4e82-9604-2ed917f8ae44	162	\N	JaCarta PKI	8DBA0651	Водопьянов Виталий Валерьевич	Дефектоскопист рентгено-	гаммаграфирования 6 разряда Аварийно-восстановительный поезд	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
f45dfdac-39f5-442e-b064-cc83764e7fca	163	\N	JaCarta PKI	6FA34560	Серин Дмитрий Васильевич	Инженер КИПиА		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
d76ae9fd-38f6-4add-9b50-c1c720b91e5c	164	\N	JaCarta PKI	37F04460	Сергеев Сергей Сергеевич	Мастер ХУ Хозяйственный участок		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
d7f4441a-ed2c-4a00-b8e0-e30182468eec	165	\N	JaCarta PKI	B6EBC28D	Матвиенко Владимир Павлович	Ведущий инж. ЭТВС		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
018322c8-b108-4238-875b-b2003d08c287	166	\N	JaCarta PKI	3F34F26D	Кажаев Алексей Сергеевич	Связь		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
ff94cdc9-b608-48e0-ab09-f67614b6aeed	167	\N	JaCarta PKI	0E5C22B3	Шебалкин Валерий Александрович	Старший механик		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
ce8d7b15-c4b7-4b75-b356-86c40e019ff3	168	\N	JaCarta PKI	4A70D8C0	Кувардин Алексей Николаевич	МИУГ		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
21274cc0-b0fe-415b-a431-64cc4284f8c9	169	\N	JaCarta PKI	7E34B09F	Михно Светлана Константиновна	УКГ		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
4f3bde3b-12b2-4e42-a64a-5cf0ac1dde3f	170	\N	JaCarta PKI	6BBBC654	Касперова Светлана Владимировна	УКГ		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
a9ee521a-061a-4b6d-87a4-8e4b0eeaac15	171	\N	JaCarta PKI	E0FC43BD	Юрин Сергей Михайлович	КИПиА		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
9918ecd6-1ee0-46c1-9075-c7d56b297cfe	172	\N	JaCarta PKI	B73F8956	Ерилин Александр Александрович	Кладовщик	РСР и МТС	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
bab7cce8-451f-41ff-a437-e0c0acec1b05	173	\N	JaCarta PKI	A952FF71	Кадушкина Елена Викторовна	Руководитель учетноконтрольной группы  главный бухгалтер		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
039f1b2e-0e22-4a73-aa24-c902606ea5c8	174	\N	JaCarta PKI	51EF75C6	Холев Михаил Викторович	Связь		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
7d531e6e-583d-4a5a-bc25-5834554f6a42	175	\N	JaCarta PKI	E6B63F48	Попова Елена Юрьевна	Инженер	РСР и МТС	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
17cbef01-769c-49eb-8499-da73d66e1bbf	176	\N	JaCarta PKI	5B109B7F	Бычков Ефим Александрович	Обходчик линейный 4р	ЛЭС	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
2aac4668-b9db-4f3a-a52c-b294c5b2f437	177	\N	JaCarta PKI	F6741999	Шалонский Дмитрий Михайлович	Старший мастер	СЗК	\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
4e641fe3-eb65-47d2-9e54-1c1a90e7bd91	178	\N	JaCarta PKI	09AF401C	Нечаева Екатерина Сергеевна	экономист по труду		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
180ef313-d9df-4a4c-9ab5-85c7de079814	179	\N	JaCarta PKI	F617C180	Лопаткин Игорь Евгеньевич	Инженер 1 категории Газокомпрессорная служба (Алгасово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
4a4ac9cd-2725-47d6-b268-e95efc86206c	180	\N	JaCarta PKI		Нестеров Андрей Владимирович	Инженер 1 категории Газокомпрессорная служба (Алгасово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
fd97c1e2-6ca3-4b93-b8db-67c276871f40	181	\N	JaCarta PKI	3793BA67	Нестеров Павел Валериевич	Инженер 2 категории Газокомпрессорная служба (Давыдово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
e47ed8b2-259c-40e0-951e-d2593cdce116	182	\N	JaCarta PKI	CAD8E33C	Глагазин Максим Юрьевич	Инженер 2 категории Газокомпрессорная служба (Алгасово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
0d980b81-8e96-46f5-bcc2-7597e5aa821a	183	\N	JaCarta PKI	09B67CA	Шевнин Илья Владимирович	Трубопроводчик линейный 5 разряда Аварийно-восстановительный поезд		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
bcbbfbc3-bcaa-4721-8f72-bd1f6af2487a	184	\N	JaCarta PKI	F358D705	Мищенко Евгений Михайлович	Механик Автотранспортное хозяйство		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
9597764c-0773-4448-9529-3edc1bcd9626	185	\N	JaCarta PKI	156FD6BC	Милованова Валентина Алексеевна	Техник 1 категории Хозяйственный участок		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
f709bd51-3659-4e16-a48b-0896fa5d5836	186	\N	JaCarta PKI	374ECEE5	КонтурЭкстерн	0 0		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
1110dfa0-2b72-47cb-8596-de44d547cecd	187	\N	JaCarta PKI	7E7942C3	Матушкин Владимир Павлович	Старший мастер Газокомпрессорная служба (Давыдово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
e0a6f634-aec9-4601-9368-71a181a80122	188	\N	JaCarta PKI	9271817E	Попов Александр Викторович	Инженер 2 категории Газокомпрессорная служба (Алгасово)		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
12035dad-326f-4286-b806-28ed2d900e6c	189	\N	JaCarta PKI	7468AA28	Решетников Виктор Васильевич	Начальник службы Служба пожарной охраны		\N	\N	\N	\N	active	\N	\N	f	2026-10-22 11:03:10.277084+03	2026-10-22 11:03:10.277084+03
\.


--
-- Data for Name: cert_types; Type: TABLE DATA; Schema: public; Owner: kcj_app
--

COPY public.cert_types (code, name, title, default_valid_years, description) FROM stdin;
1	2FA	Р”РІСѓС…С„Р°РєС‚РѕСЂРЅР°СЏ Р°СѓС‚РµРЅС‚РёС„РёРєР°С†РёСЏ	2	Р‘Р°Р·РѕРІС‹Р№ СЃРµСЂС‚РёС„РёРєР°С‚ РґР»СЏ РІС…РѕРґР° РІ РєРѕСЂРїРѕСЂР°С‚РёРІРЅС‹Рµ СЃРёСЃС‚РµРјС‹
2	Р¦РћР”	РЎРёСЃС‚РµРјР° Р¦РћР”	2	РЎРµСЂС‚РёС„РёРєР°С‚ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє СЃРёСЃС‚РµРјРµ Р¦РћР”
3	РћРїРµСЂР°С‚РѕСЂ	РћРїРµСЂР°С‚РѕСЂ РІС‹РїСѓСЃРєР° СЃРµСЂС‚РёС„РёРєР°С‚РѕРІ	1	Р”РѕРїРѕР»РЅРёС‚РµР»СЊРЅС‹Р№ СЃРµСЂС‚РёС„РёРєР°С‚ РґР»СЏ РѕРїРµСЂР°С‚РѕСЂРѕРІ РЈР¦
\.


--
-- Data for Name: certificates; Type: TABLE DATA; Schema: public; Owner: kcj_app
--

COPY public.certificates (id, carrier_id, cert_type, serial_number, valid_from, valid_to, status, note, created, updated) FROM stdin;
\.


--
-- Data for Name: users; Type: TABLE DATA; Schema: public; Owner: kcj_app
--

COPY public.users (id, login, full_name, role, salt, hash, active, created, last_login) FROM stdin;
50139f36-933e-4957-bdc8-efa9b1c0ce8d	User	User1	auditor	f902ae42fe562fcf341828e5cf679caf	1d99bfe0b068cd37e57f0454164676a1d1314b8eba48981589588891e26b2e43	t	2026-10-22 11:31:33.158014+03	\N
fab5f3da-108f-4eef-8c40-8358b69e8cb5	admin	Администратор	admin	6d0aef586df41fa412cf2cba76016ab0	30313cbe9552cae354ee32ff5c316aac0167815a6a46582bb4f532fdc45c1a64	t	2026-10-22 10:14:57.945034+03	2026-10-22 11:32:18.793553+03
\.


--
-- Name: audit audit_pkey; Type: CONSTRAINT; Schema: public; Owner: kcj_app
--

ALTER TABLE ONLY public.audit
    ADD CONSTRAINT audit_pkey PRIMARY KEY (id);


--
-- Name: carriers carriers_pkey; Type: CONSTRAINT; Schema: public; Owner: kcj_app
--

ALTER TABLE ONLY public.carriers
    ADD CONSTRAINT carriers_pkey PRIMARY KEY (id);


--
-- Name: cert_types cert_types_pkey; Type: CONSTRAINT; Schema: public; Owner: kcj_app
--

ALTER TABLE ONLY public.cert_types
    ADD CONSTRAINT cert_types_pkey PRIMARY KEY (code);


--
-- Name: certificates certificates_pkey; Type: CONSTRAINT; Schema: public; Owner: kcj_app
--

ALTER TABLE ONLY public.certificates
    ADD CONSTRAINT certificates_pkey PRIMARY KEY (id);


--
-- Name: users users_login_key; Type: CONSTRAINT; Schema: public; Owner: kcj_app
--

ALTER TABLE ONLY public.users
    ADD CONSTRAINT users_login_key UNIQUE (login);


--
-- Name: users users_pkey; Type: CONSTRAINT; Schema: public; Owner: kcj_app
--

ALTER TABLE ONLY public.users
    ADD CONSTRAINT users_pkey PRIMARY KEY (id);


--
-- Name: idx_audit_ts; Type: INDEX; Schema: public; Owner: kcj_app
--

CREATE INDEX idx_audit_ts ON public.audit USING btree (ts DESC);


--
-- Name: idx_carriers_employee; Type: INDEX; Schema: public; Owner: kcj_app
--

CREATE INDEX idx_carriers_employee ON public.carriers USING gin (employee public.gin_trgm_ops);


--
-- Name: idx_carriers_serial; Type: INDEX; Schema: public; Owner: kcj_app
--

CREATE INDEX idx_carriers_serial ON public.carriers USING btree (carrier_serial);


--
-- Name: idx_carriers_status; Type: INDEX; Schema: public; Owner: kcj_app
--

CREATE INDEX idx_carriers_status ON public.carriers USING btree (status);


--
-- Name: idx_cert_carrier; Type: INDEX; Schema: public; Owner: kcj_app
--

CREATE INDEX idx_cert_carrier ON public.certificates USING btree (carrier_id);


--
-- Name: idx_cert_status; Type: INDEX; Schema: public; Owner: kcj_app
--

CREATE INDEX idx_cert_status ON public.certificates USING btree (status);


--
-- Name: idx_cert_type; Type: INDEX; Schema: public; Owner: kcj_app
--

CREATE INDEX idx_cert_type ON public.certificates USING btree (cert_type);


--
-- Name: idx_cert_valid_to; Type: INDEX; Schema: public; Owner: kcj_app
--

CREATE INDEX idx_cert_valid_to ON public.certificates USING btree (valid_to);


--
-- Name: uq_cert_carrier_type; Type: INDEX; Schema: public; Owner: kcj_app
--

CREATE UNIQUE INDEX uq_cert_carrier_type ON public.certificates USING btree (carrier_id, cert_type);


--
-- Name: audit audit_user_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: kcj_app
--

ALTER TABLE ONLY public.audit
    ADD CONSTRAINT audit_user_id_fkey FOREIGN KEY (user_id) REFERENCES public.users(id) ON DELETE SET NULL;


--
-- Name: certificates certificates_carrier_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: kcj_app
--

ALTER TABLE ONLY public.certificates
    ADD CONSTRAINT certificates_carrier_id_fkey FOREIGN KEY (carrier_id) REFERENCES public.carriers(id) ON DELETE CASCADE;


--
-- Name: certificates certificates_cert_type_fkey; Type: FK CONSTRAINT; Schema: public; Owner: kcj_app
--

ALTER TABLE ONLY public.certificates
    ADD CONSTRAINT certificates_cert_type_fkey FOREIGN KEY (cert_type) REFERENCES public.cert_types(code);


--
-- Name: SCHEMA public; Type: ACL; Schema: -; Owner: pg_database_owner
--

GRANT ALL ON SCHEMA public TO kcj_app;


--
-- PostgreSQL database dump complete
--

\unrestrict 1ZEJ10bydFbhb6gQJCgUvavLCtDJYnbkmOHd2bqh9K3m2wa6Nfc5qcvkfirAYA8

